skeddit/app/models/user.rb

  def reset_session_token!
    #
    self.session_token = User.generate_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "zLUY_BmfI2qpsyQPvMjoRg"], ["updated_at", "2022-03-18 19:38:30.928407"], ["id", 1]]