skeddit/app/views/users/index.html.erb


    <% if user.username.include?("harry") %>
---
SELECT "users".* FROM "users"